Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: གང་ཡི་གེ་དང་བྲལ་བ་དེ་ནི་ཕྱིར་མི་འོང་བའོ། །
en: Those who are free from words are non-returners.

source: དེ་ཁམས་གསུམ་ཐམས་ཅད་གྲངས་མེད་པའི་དུས་གསུམ་དང་བྲལ་བའི་སེམས་སོ། །
en: Their minds are free from the countless formations associated with the three times and the three realms.

source: གང་དེ་ལྟར་ཆོས་ནི་འོང་བ་ཡང་མེད། ཉེ་བར་འོང་བ་མེད་པ་ཐོབ་པ་ནི་གང་ཚུལ་གཅིག་གི་ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་ཤེས་སོ། །
en: Those who have attained the state in which phenomena do not arise and do not return understand the way in which phenomena are likenesses.

source: འགྲོ་བ་དང་འོང་བ་མེད་པ། ཉེ་བར་ཐོབ་པ་མེད་དོ། །
en: They do not go, they do not come, and they are not attained.

source: ཆུང་ཟད་ཀྱང་ཆགས་པར་མི་བྱེད་དོ། །
en: They do not cause any attachment whatsoever.

source: བཅིངས་པའང་མེད། གྲོལ་བའང་མེད། འདུག་པའང་མེད།
en: They are not bound, they are not liberated, they do not remain, and they do not abide.

source: གནས་པའང་མེད་པ་དེ་ཆོས་ཐམས་ཅད་སོ་སོར་མི་གནས་པའི་སྒོར་རབ་ཏུ་ཤེས་སོ། །གང་ཆོས་ཐམས་ཅད་སོ་སོར་གནས་པའི་སྒོར་རབ་ཏུ་ཤེས་སོ། །
en: They understand each and every phenomenon as the gateway to nonabiding, and they understand each and every phenomenon as the gateway to abiding.

source: འཆི་འཕོ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་གང་དེ་ལྟར་ཆོས་ཉེ་བར་ཐོབ་པ་ལ་རྟེན་པར་རབ་ཏུ་ཤེས་སོ། །
en: They know that freedom from death and rebirth depends on the realization of the Dharma.

source: གང་ཆོས་ཐམས་ཅད་ལ་རྟེན་པ་མེད་པས་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་དང་བྲལ་ལོ། །
en: Since they do not depend on any phenomena, they are free from all the various types of phenomena.

source: གང་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་དང་བྲལ་བས་དེ་འཚོ་བ་དང་། གསོ་བ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་བྲལ་ལོ། །
en: Since they are free from all the various types of phenomena, they are free from life forces, souls, persons, human beings, and individuals.

source: གང་འཚོ་བ་དང་།
en: Since they are free from life forces, souls, persons, human beings, and individuals, they never stray from voidness and emptiness.

source: གསོ་བ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་བྲལ་བས་དེ་གསོག་དང་། སྟོང་པ་ལས་མ་འདས་པ་ནི་ཚད་མེད་པའི་སྟོང་པ་འདུ་བྱེད་ཐམས་ཅད་དུ་ལྟའོ། །
en: They regard all formations as limitless emptiness.

source: གང་རིགས་ཀྱི་བུ་ཚད་མེད་པའི་སྟོང་པའི་ཕྱིར་དེ་སེམས་ལ་ཤིན་ཏུ་སྒོམ་པར་བྱེད་དོ། །འདི་ལ་ཟད་པ་མེད་པའི་གོ་ཆ་བཞི་སོ་སོར་ཐོབ་བོ། །
en: “Those noble sons meditate upon the mind because it is limitless emptiness, and each of them achieves the four inexhaustible armors.

source: དེ་ཟད་པ་མེད་པས་མཉམ་པར་ལེན་པའི་ལོངས་སྤྱོད་དུ་འགྱུར་རོ། །
en: They become resources that one grasps as equal due to their inexhaustible nature.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པས་བསོད་ནམས་མི་ཟད་པར་འགྱུར་རོ། །
en: Since they ripen beings, their merit will be inexhaustible.

source: སྤོབས་པ་ཟད་པ་མེད་པས་ཆོས་སྟོན་པར་འགྱུར་རོ། །
en: They will teach the Dharma with inexhaustible eloquence.

source: ཐབས་མི་ཟད་པས་ཡེ་ཤེས་ལ་མཁས་པར་འགྱུར་རོ། །
en: They will master wisdom through inexhaustible means.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པའི་དོན་གྱིས་སེམས་ཅན་རྣམ་པར་ཐར་པའི་སྒོ་ཡོངས་སུ་བསགས་པས་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱེད་དོ། །
en: They reveal ultimate reality by accumulating the gateways to liberating beings in order to ripen beings.

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་རབ་ཏུ་ཤེས་སོ། །སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་མི་འདོར་རོ། །
en: They understand that all phenomena lack a self, and they never give up ripening beings with the armor of great compassion.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཆུ་ཟླ་དང་མཉམ་པ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པའི་དོན་ལ་འཇུག་གོ། །
en: In every buddha realm they carry out the goal of ripening beings who are like the reflection of the moon in water.

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པས་སེམས་ཅན་གྱི་ཚུལ་ཁྲིམས་ཏིང་ངེ་འཛིན་དུ་སྒྲུབ་པ་ལ་མཁས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་ཏོ། །
en: Since all phenomena lack a self, those skilled ones ripen beings by accomplishing the taming of beings while in a state of absorption.

source: འཚོ་བར་འགྲོ་བ་དང་། གསོ་བ་དང་། གང་ཟག་ལ་རྟག་ཏུ་གཅོད་པའི་ཆུ་བོ་ལས་རྒལ་བར་འགྱུར་རོ། །
en: They will ford the river that permanently eliminates views regarding the life force, transmigration, souls, and persons.

source: དུས་གསུམ་ཐམས་ཅད་ཀྱི་ལུས་དང་། ངག་དང་ཡིད་ཀྱི་འདུ་བྱེད་མེད་པས་སེམས་ཅན་གྱི་ཚེ་རྒྱ་མཚོ་ལས་རྒལ་བར་འགྱུར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་སྟོན་པ་ཞེས་བྱའོ། །
en: Since formations such as the physical, verbal, and mental formations of the three times are nonexistent, they will cross over the ocean of beings’ existence. This is known as demonstrating the unobstructed wisdom of the bodhisattvas.”

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཕྲག་ས་ཡ་དྲུག་ཅུ་རྩ་བརྒྱད་ལ་འདི་དག་འཆད་པ་བཤད་པས་ཆོས་ཀྱི་རྗེས་སུ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སེམས་ཅན་བརྒྱ་སྟོང་ཕྲག་བྱེ་བ་བརྒྱད་ཅུ་རྩ་བཞི་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །ཕྱིར་མི་ལྡོག་པའི་སར་སེམས་བསྐྱེད་དོ། །ཕྱིར་མི་ལྡོག་པའི་ས་ལ་སོ་སོར་གནས་པར་འགྱུར་རོ། །
en: As this teaching was being delivered, 6,800,000,000,000 bodhisattvas attained further acceptance of phenomena, and 84,000,000,000,000 followers of the vehicle of the solitary buddhas gave rise to the mind set on unsurpassed and perfect awakening, the mind set on the stage of nonregression, and each abided in that stage of nonregression.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གཉེན་དུ་ལྟ་བ་དེ་ལ་བོས་སོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་དང་། མི་འབྱུང་བ་ལ་གནས་པའི་ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ལ་གནས་པ་ནི་འདི་ལྟ་སྟེ།
en: The Blessed One then addressed the bodhisattva Regarded as a Friend, saying, “Noble son, whether or not the thus-gone ones appear in this world, the abiding nature of reality, the realm of phenomena, and phenomena themselves remain as follows: From what arises with ignorance as the condition up to the formations is nothing but a great mass of suffering.

source: མ་རིག་པའི་རྐྱེན་དང་། འདུ་བྱེད་དེའི་བར་དུ་འབའ་ཞིག་ཏུ་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་ཀུན་ཏུ་འབྱུང་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགགས་པ་དེའི་བར་དུ་སྡུག་བསྔལ་གྱི་ཕུང་པོ་འགགས་པར་འགྱུར་རོ། །
en: Furthermore, with the ceasing of ignorance up to the ceasing of formations, this great mass of suffering also ceases.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་འབྱུང་བས། སེམས་ཅན་མངོན་སུམ་དུ་བྱས་པ་འདི་དག་ཆོས་ཀྱི་རྐྱེན་གྱིས་བྱང་ཆུབ་ཐོབ་བོ། །འདི་ལ་ཆོས་གཞན་དག་རྣམ་པར་རྒྱས་པར་ཀུན་ཏུ་མི་སྒྲོགས་པར་འགྱུར་རོ། །
en: In this way, by following the thus-gone ones, beings have realized this and attained awakening by means of the Dharma, and they will no longer propagate or proclaim other types of Dharma.

source: གང་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་འབྱུང་བས་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དེའི་དུས་ན་སེམས་ཅན་རྣམ་པར་རྒྱས་པར་རབ་ཏུ་སྒྲོག་གོ། །སྟོན་ཏོ། །
en: When the thus-gone ones appear in the world, those worthy, perfect buddhas propagate and proclaim and teach the Dharma to beings.

source: ཡང་དག་པ་དེ་ལྟར་གཞན་མ་ཡིན་པའི་སེམས་ཅན་འཁོར་བའི་ཆུ་བོ་ལས་རྒལ་བར་འགྱུར་རོ། །ཞི་བ་དང་བདེ་བ་དང་མྱ་ངན་ལས་འདས་པའི་ལམ་ལ་སོ་སོར་གནས་སོ། །
en: Those beings for whom there is no other truth then cross over the river of saṃsāra, and they each remain on the path that leads to peace, happiness, and nirvāṇa.”

source: འདི་ལ་ཡང་ལུང་བསྟན་བཤད་པས་མེ་བཅུ་རྡུལ་ཡལ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུའི་སེམས་ཅན་དག་རང་སངས་རྒྱས་ཀྱི་རྡུལ་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་སོ་སོར་ཐོབ་པར་འགྱུར་རོ། །
en: As this proclamation was being delivered, myriads of beings attained the immaculate absorption of the solitary buddhas and reached the vehicle of the solitary buddhas.

source: སོ་སོར་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའ་ལ་འགྲོ་བའི་འོད་ཀྱིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། ལེའུ་བདུན་ནོ།། །།
en: This was the seventh chapter of the Great Vehicle sūtra entitled “The Acceptance That Tames Beings with Light Rays That Travel through Space.”

source: བམ་པོ་བརྒྱད་པ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མི་སྣང་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་དུ་ཞུགས་སོ། །དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་དུ་ཞུགས་ནས།
en: Chapter 8 The Blessed One then entered the invisible ornament absorption.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོར་ཁ་དོག་སྣ་ཚོགས་ཀྱི་འོད་བྱུང་ངོ་། །ཕྱོགས་བཅུ་ཀུན་ནས་ཆུ་བོ་གང་གཱའི་བྱེ་མ་དང་མཉམ་པའི་རྙོག་པ་ལྔ་ན་སངས་རྒྱས་ཀྱི་ཞིང་ལས་འོད་བྱུང་ངོ་། །ཕྱོགས་བཅུ་ཀུན་ནས་ཆུ་བོ་གང་གཱའི་བྱེ་མ་དང་མཉམ་པའི་རྙོག་པ་ལྔ་ན་སངས་རྒྱས་ཀྱི་ཞིང་གི་འོད་དུ་འགྲོའོ། །གང་དེ་ལ་ཉན་ཐོས་དང་།
en: After the Thus-Gone One entered that absorption, multicolored light radiated from the Blessed One’s mouth and illuminated buddha realms of the ten directions inundated with the five impurities as numerous as all the grains of sand in the Ganges.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་འགྲོ་བའི་སེམས་ཅན་འོད་ལ་རེག་ནས། ཉན་ཐོས་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་དེ་ལ་སེམས་ཅན་དེ་བཞིན་དུ་གཟུགས་དང་། ལུས་དང་། བདེ་བའི་ཚོར་བ་འབྱུང་བར་འགྱུར་རོ། །
en: As the hearers and beings who followed the vehicle of the hearers in those places were touched by that light, they experienced blissful feelings in their bodies.

source: འདི་ལྟ་སྟེ། བསམ་གཏན་གསུམ་པའི་ཏིང་ངེ་འཛིན་དུ་འཇུག་པ་དགའ་བ་མེད་པའི་དགེ་སློང་དེས་ཕྱོགས་བཞིར་བལྟས་ནས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་དཔག་ཚད་ཕྱེད་ཚུན་ཆད་དུ་བལྟས་ན་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་བརྒྱན་པ་ཐམས་ཅད་ལྟ་བར་དེ་ལྟར་སྔོན་གསུངས་སོ། །
en: When the monks who did not experience such joy because they had entered the absorption of the third concentration level scanned the four directions, they saw that the blessed Śākyamuni was half a league away from them and saw all the ornaments that adorned Mount Gandhamādana just as they were described before.

source: རིན་པོ་ཆེ་བདུན་གྱི་རང་བཞིན་གྱི་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་བྱང་ཆུབ་སེམས་དཔས་གང་བ་ལ་བལྟའོ། །
en: They saw Mount Gandhamādana in its natural state, in which it is made of the seven precious substances, and saw that it was filled with bodhisattvas.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་དེ་དག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ། སྐད་ཅིག་ཡུད་ཙམ་གྱིས་སྐབས་ཕྱེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་པར་གྱུར་ཏོ། །
en: Through the power of the Blessed One, they departed for the place where the blessed Śākyamuni was residing and assembled before the Blessed One as soon as they were given the opportunity.

source: ཉན་ཐོས་པ་རྣམས་དང་། ཉན་ཐོས་པའི་ཐེག་པ་ཅན་རྣམས་ཀྱི་སེམས་ཅན་རྣམས་ཀྱང་། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་ཆོས་མཉན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: The hearers and beings following the vehicle of the hearers also departed for the place where the blessed Śākyamuni was residing and assembled before Śākyamuni to listen to the Dharma.

source: གང་ཡང་ཉན་ཐོས་ཆེན་པོའི་ཐེག་པ་དེ་ཀུ་རུའི་གྲོང་རྡལ་དུ་སོ་སོ་ནས་བསྡུས་ཏེ་ཐིམ་པར་གནས་སོ། །
en: Some followers of the vehicle of the great hearers were holding their own assembly in the town of Kuru where they were dwelling in a state of repose.

source: དེ་ཡང་འོད་དེ་ཡང་དག་པར་ཤེས་པ་དང་། དེ་ཡང་ཟང་ཟིང་མེད་པའི་དགའ་བ་དང་བདེ་བས་ཚིམ་པར་བྱས་པ་ཡོད་པ་དེ་ལས་ལྷན་ཅིག་ཏུ་ལངས་ཏེ་བཅོམ་ལྡན་འདས་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་བཞུགས་པ་མཐོང་ངོ་། །
en: After they perceived that light and had been sated by the joy and happiness of being detached from material things, all of them awoke at the same time and saw the Blessed One residing at Mount Gandhamādana.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་། ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ། རྒྱན་ཆེན་པོ་མཐོང་ནས་དེ་དག་གཞན་ཡང་ཡང་དག་པར་ཤེས་སོ། །
en: They saw that he was surrounded and attended by assemblies of bodhisattvas and hearers, saw the great array, and understood perfectly.

source: བཙུན་པ་དགོངས་ཤིག། །བདག་ནི་ད་ལྟར་དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་བཞུགས་ཤིང་རྒྱན་ཆེན་པོ་དང་ཚོགས་ཆེན་པོའི་འཁོར་གྱིས་བདག་ཀྱང་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ཉེ་བར་སོང་ངོ་། །
en: “Look, venerable monks,” they said, “right now the Thus-Gone One is residing on Mount Gandhamādana surrounded by a great array and those great assemblies.

source: དེ་ནས་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་ཉན་ཐོས་ཆེན་པོ་ཇི་སྙེད་པ་དང་།
en: We should leave and go to where the Blessed One is residing so that we can listen to the Dharma!”

source: ཉན་ཐོས་དང་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ཆོས་མཉན་པའི་ཕྱིར་འཁོད་དོ། །
en: All the great hearers of this Sahā buddha realm, as well as all the other hearers and followers of the vehicle of the hearers, then assembled before the Blessed One to listen to the Dharma.

source: ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་ཉན་ཐོས་དང་། ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་སེམས་ཅན་རྣམས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: Immeasurable, countless, infinite hearers, and immeasurable, countless, infinite beings following the vehicle of the hearers, were assembled before the Blessed One to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བོས་ཏེ་རབ་འབྱོར་འདི་ནི་སྨིན་པ་དང་རྣམ་པར་སྨིན་པ་ཞེས་བྱའོ། །
en: The Blessed One then addressed Venerable Subhūti, saying, “Subhūti, this circumstance is known as ripening and complete ripening.

source: རབ་འབྱོར་དེ་ཙམ་གྱི་བར་དུ་རྣམ་པར་སྨིན་པ་ཞེས་བྱའོ།
en: Subhūti, to what extent is there complete ripening?”

source: རབ་འབྱོར་གྱིས་གསོལ་པ། གང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྨིན་པའི་མཚན་ཉིད་འབྱུང་བ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་རྣམ་པར་སྨིན་པ་ནམ་མཁའི་མཛོད་རྒྱས་པ་སེམས་ཅན་གཅིག་ཀྱང་མྱ་ངན་ལས་འདས་པར་མི་འགྱུར་རོ། །
en: Subhūti replied, “Blessed One, if your fully ripened characteristics were present, not a single being would enter nirvāṇa, since the Thus-Gone One’s fully ripened characteristics are a treasury as vast as space.

source: སེམས་ཅན་དེ་ཐམས་ཅད་ཀྱང་འཇིགས་ཤིང་འཇིགས་པར་འགྱུར་བས་གཅིག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཆུང་ཟད་ཀྱང་མེད་དོ། །
en: It would frighten all of those beings and since they would be afraid, not a single one among them would give rise to the mind set on unsurpassed and perfect awakening.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པའི་མཚན་ཉིད་དེ་རེ་རེ་ལ་ཡང་མཚན་ཉིད་རྣམ་པར་སྨིན་པ་ལ་གཟུགས་མེད་པ་དང་།
en: Each one of the immeasurable characteristics of a thus-gone one and their fully ripened characteristics are without form and devoid of characteristics.

source: མཚན་ཉིད་མེད་པ་དང་།
en: All of their insubstantial bodies are free from characteristics.

source: དངོས་པོ་མེད་པའི་ལུས་ཐམས་ཅད་མཚན་ཉིད་དང་བྲལ་ཞིང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་འདྲ་བར་མཉམ་ཞིང་གཟུགས་མེད་པ་ལ་སོ་སོར་དགོད་པ་མེད་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་བར་དུ་རྣམ་པར་ཤེས་པ་ལ་སོ་སོར་དགོད་དོ། །
en: All of the qualities of the Buddha are like space, formless, and each of them is not established. Everything up to the qualities of a buddha is established in consciousness.

source: སངས་རྒྱས་ཀྱི་ཆོས་ལ་མིག་གི་ཁམས་དགོད་པ་མེད་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པ་དེའི་བར་དུ་ཡིད་ཀྱི་ཁམས་ལ་དགོད་པ་མེད་པས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པའོ། །
en: The qualities of a buddha are fully ripened, since everything up to the fully ripened qualities of a buddha is not established in the mind element, and the eye element is not established in the qualities of a buddha.

source: གཟུགས་ཀྱི་ཁམས་ལ་དགོད་པ་མེད་པས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པ་དེའི་བར་དུ་རེག་པ་སོ་སོར་དགོད་པ་མེད་པའོ། །
en: Since there is nothing established in the form element, tactile sensation is not established in anything up to the fully ripened qualities of a buddha.

source: ཡང་སའི་ཁམས་སོ་སོར་དགོད་པ་མེད་པས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པ་དེའི་བར་དུ་རླུང་སོ་སོར་དགོད་དུ་མེད་པས་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་སྨིན་པའོ། །
en: Since the earth element is not established in anything, and since wind is not established in anything up to the fully ripened qualities of a buddha, the realm of a buddha is fully ripened.

source: འདོད་པའི་ཁམས་སོ་སོར་དགོད་པ་མེད་པས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པ་དེའི་བར་དུ་གཟུགས་ཀྱི་ཁམས་སོ་སོར་དགོད་པ་མེད་པས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པའོ། །
en: Since the desire realm is not established in anything and the form realm is not established in anything, up to the fully ripened qualities of a buddha, the qualities of a buddha are fully ripened.

source: བདག་དང་གཞན་དུ་མི་རྟེན་པ་དང་། ང་རྒྱལ་ལ་མི་རྟེན་པ་དང་། ཡིད་ལ་བྱེད་པ་ལ་མི་རྟེན་པ་དང་། རྟག་པ་ལ་མི་རྟེན་པ་དང་། ཆད་པ་ལ་མི་རྟེན་པས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པའོ། །
en: The qualities of a buddha are fully ripened by not relying on self and other, on pride, on mental engagement, on permanence, or on annihilation.

source: ཡི་གེའི་ཕྱི་མོ་དང་། མཚན་མ་ལ་མི་རྟེན་པས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམ་པར་སྨིན་པའོ། །
en: The qualities of a buddha are fully ripened by not relying on enumerative lists and marks.

source: བཅོམ་ལྡན་འདས་མཚན་ཉིད་མེད་པས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཐམས་ཅད་བཤད་པ་ནི་རང་གི་མཚན་ཉིད་དང་བྲལ་བ་སྟོང་པའི་ཚུལ་གྱི་སྤྱོད་ཡུལ་ལོ། །
en: Since the Blessed One lacks characteristics, all of the qualities that the Blessed One has mentioned are free from characteristics and are the domain of the mode of emptiness.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One then said, “Excellent Subhūti, excellent!

source: རབ་འབྱོར་ཁྱོད་དེ་ལྟར་དེ་བཞིན་དུ་ཤིན་ཏུ་སྨྲས་པ་ནི་རབ་འབྱོར་གང་ཡང་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་སྨིན་པ་སྒྲུབ་པ་ནི་མཚན་ཉིད་མེད་པར་འགྱུར་རོ། །
en: Just as you have said, the accomplishment of the thus-gone ones’ ripening is without characteristics.

source: དེ་ཡང་དེ་བཞིན་གཤེགས་པའི་སེམས་ཅན་དུ་འཛིན་པར་འགྱུར་རོ། །སྲོག་ཏུ་འཛིན་པ་དང་། གསོ་བར་འཛིན་པ་དང་།
en: Furthermore, there is clinging to the thus-gone one as a being, clinging to a life force, clinging to a soul, and clinging to a person.

source: གང་ཟག་ཏུ་འཛིན་པ་དེ་ཡང་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་སེམས་ཅན་དུ་འཛིན་པའི་མཚན་ཉིད་དུ་འགྱུར་རོ། །དེའི་བར་དུ་གང་ཟག་ཏུ་འཛིན་པར་འགྱུར་རོ། །
en: Furthermore, Subhūti, there are the characteristics related to clinging to the thus-gone one as a being up to the characteristics related to clinging to a person.

source: ཡང་དེ་བཞིན་གཤེགས་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཁྱད་པར་དུ་འཕགས་པ་མ་ཡིན།
en: But these are not the highly exalted state of the thus-gone ones, the hearers, and the solitary buddhas.

source: ཡེ་ཤེས་ལ་མཁས་པར་འགྱུར་རོ། །
en: They have gained mastery over wisdom.

source: གང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ཐོག་མར་སེམས་བསྐྱེད་པས་དགེ་བའི་རྩ་བའི་མཚན་ཉིད་རྣམ་པར་སྨིན་པ་དབེན་པའི་མཚན་ཉིད་ལ་རྣམ་པར་རྟོག་པར་བྱང་ཆུབ་སེམས་དཔས་བརྗོད་དོ། །
en: Subhūti, after a bodhisattva gives rise to the mind set on awakening for the first time, the bodhisattva expresses the conception of the characteristics of fully ripening the roots of virtue and the characteristics of detachment.

source: གང་དེ་ལ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་མཚན་ཉིད་ཀྱི་འདུ་ཤེས་དང་། དེ་ལ་སྤྲོས་པ་ཡོངས་སུ་འཛིན་པའི་འདུ་ཤེས་དང་།
en: Because, Subhūti, they have a perception of the characteristics of a bodhisattva, and they have a perception that clings to elaborations about this.

source: གང་ལས་སྤྲོས་པ་ཡོངས་སུ་འཛིན་པའི་འདུ་ཤེས་དང་། ང་རྒྱལ་གྱི་འདུ་ཤེས་དང་། མི་རྟག་པའི་འདུ་ཤེས་དང་།
en: Due to that perception that clings to elaborations, there is a perception of pride and a perception of impermanence.

source: དེ་ལ་ཐམས་ཅད་བདེ་བར་འདོད་པའི་འདུ་ཤེས་དང་། གང་ལ་བདེ་བར་འདོད་པའི་འདུ་ཤེས་དེ་ལ་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོར་མི་འགྱུར་རོ། །
en: They have the perception of wanting all beings to be happy, and the perception they have of wishing for happiness will not give rise to great love and great compassion.

source: རབ་འབྱོར་གང་ལ་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོར་བསམ་པ་དང་སེམས་པར་མི་འགྱུར་རོ། །
en: Subhūti, those bodhisattvas will not conceive of or think about great love and great compassion.

source: དེ་ལ་ཐར་བར་ཡོངས་སུ་བསྔོས་པས་དགེ་བའི་རྩ་བ་མི་ལྡང་བ་ལས་ཀྱང་ཐར་ཏོ། །
en: By dedicating them to liberation, one is also free of not giving rise to roots of virtue.

source: དེ་བས་ན་རབ་འབྱོར་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་དང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་མ་འཁྲུགས་པས་ཐར་བར་ཡོངས་སུ་བསྔོས་པ་དགེ་བའི་རྩ་བར་བརྗོད་དོ། །
en: Therefore, Subhūti, one should proclaim that the roots of virtue are dedicated to liberation in a way that does not contradict the purity of the three fields and the six perfections.

source: དེ་ལྟར་ནམ་མཁའ་ལ་མི་རྟོག་གོ། །རྣམ་པར་མི་རྟོག་པ་དེ་ལྟར་དེ་བཞིན་དུ་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སྤོང་བར་བྱང་ཆུབ་སེམས་དཔས་བརྗོད་དོ། །
en: “Just as there are no thoughts or concepts in space, bodhisattvas claim to have abandoned all thoughts and concepts.

source: འདི་ལྟ་སྟེ། ཡང་རབ་འབྱོར་ཟླ་བ་འཕེལ་བ་ཞེས་བྱ་བའི་སྨན་གྱི་རྒྱལ་པོས་ནད་དང་ན་བ་ཐམས་ཅད་སེལ་བ་ལ་ཟླ་བ་འཕེལ་བའི་སྨན་གྱི་རྒྱལ་པོས་དེ་བཞིན་དུ་མི་རྟོག་པར་འགྱུར་རོ། །
en: For example, Subhūti, the king of medicines called waxing moon cures all sicknesses and diseases, and it does so without thinking.

source: བདག་གིས་ནད་ཐམས་ཅད་བསལ་བས་ཡང་དེའི་ནད་དེ་བཞིན་དུ་རྟོག་པར་ཡང་མི་འགྱུར་རོ། །
en: It cures all our diseases without thinking about the one who has the illness.

source: བདག་གི་ལུས་འདི་ལ་སྨན་གྱིས་སེལ་བར་འགྱུར་རོ། །
en: The medicine heals this body of ours without conceiving of or thinking about reciprocation and it pacifies all diseases.

source: ཕན་ཚུན་དུ་རྣམ་པར་རྟོག་པ་མེད་ཅིང་མི་རྟོག་པས་ནད་ཐམས་ཅད་ཞི་བ་དེ་ལྟར་དེ་བཞིན་དུ་རབ་འབྱོར་གང་བྱང་ཆུབ་སེམས་དཔས་ཆུང་ངུ་ནའང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཀུན་ཏུ་སྤྱོད་དོ། །
en: Subhūti, that is how even bodhisattvas at the lowest stage should practice the six perfections.

source: གལ་ཏེ་སྦྱིན་པ་བྱིན་པ་དང་ཤེས་རབ་ཇི་སྙེད་པ་སྒོམ་མོ། །དངོས་པོ་དེ་ལ་རྟོག་པའང་མེད། ལེན་པའང་མེད།
en: When they cultivate all manner of generosity and insight, they do not conceive of or grasp at entities.

source: དེ་བས་རྣམ་པར་སྨིན་པ་ལ་རྟོག་པའང་མེད།
en: As a result, they do not think about complete ripening.

source: ཡང་གཟུགས་ལ་རྟེན་པ་ཀུན་ཏུ་སྤྱོད་པ་ཡང་མེད་པ་ནས་རྣམ་པར་ཤེས་པའི་བར་དུ་རྟེན་ཅིང་ཀུན་ཏུ་སྤྱོད་པའང་མེད།
en: They do not rely upon or conduct themselves according to forms, and they do not rely upon or conduct themselves according to anything up to consciousness.

source: ཡང་གཟུགས་ལ་རྟེན་ཅིང་ཀུན་ཏུ་སྤྱོད་པ་མེད་པ་ནས། རེག་པའི་བར་དུ་རྟེན་ཅིང་ཀུན་ཏུ་སྤྱོད་པའང་མེད་དོ། །
en: Since they do not rely upon or conduct themselves according to forms, they do not rely upon and do not conduct themselves according to anything up to tactile sensations.

source: དེའི་མིང་དུ་ཡང་འཛིན་པར་མི་འགྱུར་བ་ནས་གང་ཟག་གི་བར་དུ་ཡང་འཛིན་པར་མི་འགྱུར་རོ། །
en: They do not cling to names, and they do not cling to anything up to persons.

source: གང་ཁམས་གསུམ་ཐམས་ཅད་ཡུལ་མེད་པ་དང་། གཡོ་བ་དང་ཆུང་ངུ་ཞེས་བྱ་བ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྤྱོད་དོ། །
en: They practice the six perfections knowing that the entirety of the three realms is without object, unstable, and lowly.

source: འདི་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་ནམ་མཁའ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཚད་མེད་པའི་ཤེས་རབ་ཀྱི་ཕུང་པོར་འགྱུར་རོ།
en: When bodhisattvas have no thoughts and no concepts, they have an immeasurable amount of insight that is just like space.

source: ཁམས་གསུམ་ཐམས་ཅད་ན་ཉོན་མོངས་པ་སྤངས་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འཚང་རྒྱའོ། །
en: They will abandon the afflictions in all three realms and swiftly awaken to unsurpassed and perfect buddhahood.

source: རབ་འབྱོར་དེ་བས་ན་ཐར་པའི་ལམ་ལ་འདོད་པས་སེམས་ཅན་གྱི་འདུ་ཤེས་ཀྱི་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པར་མི་བྱ་བ་ནས་གང་ཟག་གི་འདུ་ཤེས་ཀྱིས་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པར་མི་བྱའོ། །
en: “Therefore, Subhūti, those who wish for the path of liberation should not do anything from practicing virtue based on the perception of a being up to practicing virtue based on the perception of a person.

source: ཕུང་པོའི་འདུ་ཤེས་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་འདུ་ཤེས་ཀྱིས་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པར་མི་བྱའོ། །
en: They should not practice virtue based on the perception of the aggregates, or the perception of the elements, or of the sense fields.

source: ང་ཡིར་བྱ་བ་དང་བདག་གིར་བྱ་བའི་འདུ་ཤེས་ཀྱིས་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པར་མི་བྱའོ། །
en: They should not practice virtue based on the perception of possession and ownership.

source: འདོད་པའི་འདུ་ཤེས་དང་། གཟུགས་ཡོད་པའི་འདུ་ཤེས་དང་། གཟུགས་མེད་པའི་འདུ་ཤེས་ཀྱིས་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པར་མི་བྱའོ། །
en: They should not practice virtue based on the perception of the desire realm, the perception of the form realm, or the perception of the formless realm.

source: རབ་འབྱོར་དེ་ལྟར་སེམས་ཅན་དང་ནམ་མཁའ་དང་། ཐར་པ་དང་། རྣམ་པར་སྨིན་པའི་མཚན་ཉིད་ལ་བདག་མེད་པ་ཞེས་བྱ་བ་ནི་མ་ལུས་པ་དང་ཐ་མི་དད་པར་སྟོང་པ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ། །
en: Because, Subhūti, the characteristics of beings, space, liberation, and ripening are said to lack a self, and what is referred to as nirvāṇa is inseparably and completely empty.”
